tests/integration/outbound_payment_imports_integration_test.py

# WARNING: Do not edit by hand, this file was generated by Crank:
#
#   https://github.com/gocardless/crank
#

import json

import pytest
import requests
import responses

from gocardless_pro.errors import MalformedResponseError
from gocardless_pro import resources
from gocardless_pro import list_response

from .. import helpers

@responses.activate
def test_outbound_payment_imports_create():
    fixture = helpers.load_fixture('outbound_payment_imports')['create']
    helpers.stub_response(fixture)
    response = helpers.client.outbound_payment_imports.create(*fixture['url_params'])
    if fixture['body'].get('outbound_payment_imports') is not None and isinstance(fixture['body'].get('outbound_payment_imports'), (dict, list)):
        body = fixture['body']['outbound_payment_imports']
    else:
        body = fixture['body']

    assert isinstance(response, resources.OutboundPaymentImport)
    assert responses.calls[-1].request.headers.get('Idempotency-Key') is not None
    assert response.amount_sum == body.get('amount_sum')
    assert response.authorisation_url == body.get('authorisation_url')
    assert response.created_at == body.get('created_at')
    assert response.currency == body.get('currency')
    assert response.id == body.get('id')
    assert response.status == body.get('status')
    assert response.entry_counts.failed_to_process == body.get('entry_counts')['failed_to_process']
    assert response.entry_counts.invalid == body.get('entry_counts')['invalid']
    assert response.entry_counts.processed == body.get('entry_counts')['processed']
    assert response.entry_counts.total == body.get('entry_counts')['total']
    assert response.entry_counts.valid == body.get('entry_counts')['valid']
    assert response.entry_counts.verified == body.get('entry_counts')['verified']
    assert response.entry_counts.verified_with_full_match == body.get('entry_counts')['verified_with_full_match']
    assert response.entry_counts.verified_with_no_match == body.get('entry_counts')['verified_with_no_match']
    assert response.entry_counts.verified_with_partial_match == body.get('entry_counts')['verified_with_partial_match']
    assert response.entry_counts.verified_with_unable_to_match == body.get('entry_counts')['verified_with_unable_to_match']
    assert response.links.creditor == body.get('links')['creditor']

@responses.activate
def test_outbound_payment_imports_create_new_idempotency_key_for_each_call():
    fixture = helpers.load_fixture('outbound_payment_imports')['create']
    helpers.stub_response(fixture)
    helpers.client.outbound_payment_imports.create(*fixture['url_params'])
    helpers.client.outbound_payment_imports.create(*fixture['url_params'])
    assert responses.calls[0].request.headers.get('Idempotency-Key') != responses.calls[1].request.headers.get('Idempotency-Key')

def test_timeout_outbound_payment_imports_create_idempotency_conflict():
    create_fixture = helpers.load_fixture('outbound_payment_imports')['create']
    get_fixture = helpers.load_fixture('outbound_payment_imports')['get']
    with helpers.stub_timeout_then_idempotency_conflict(create_fixture, get_fixture) as rsps:
      response = helpers.client.outbound_payment_imports.create(*create_fixture['url_params'])
      assert len(rsps.calls) == 2

    assert isinstance(response, resources.OutboundPaymentImport)

@responses.activate
def test_timeout_outbound_payment_imports_create_retries():
    fixture = helpers.load_fixture('outbound_payment_imports')['create']
    with helpers.stub_timeout_then_response(fixture) as rsps:
      response = helpers.client.outbound_payment_imports.create(*fixture['url_params'])
      assert len(rsps.calls) == 2
      assert rsps.calls[0].request.headers.get('Idempotency-Key') == rsps.calls[1].request.headers.get('Idempotency-Key')

    assert isinstance(response, resources.OutboundPaymentImport)

def test_502_outbound_payment_imports_create_retries():
    fixture = helpers.load_fixture('outbound_payment_imports')['create']
    with helpers.stub_502_then_response(fixture) as rsps:
      response = helpers.client.outbound_payment_imports.create(*fixture['url_params'])
      assert len(rsps.calls) == 2
      assert rsps.calls[0].request.headers.get('Idempotency-Key') == rsps.calls[1].request.headers.get('Idempotency-Key')

    assert isinstance(response, resources.OutboundPaymentImport)

@responses.activate
def test_outbound_payment_imports_get():
    fixture = helpers.load_fixture('outbound_payment_imports')['get']
    helpers.stub_response(fixture)
    response = helpers.client.outbound_payment_imports.get(*fixture['url_params'])
    if fixture['body'].get('outbound_payment_imports') is not None and isinstance(fixture['body'].get('outbound_payment_imports'), (dict, list)):
        body = fixture['body']['outbound_payment_imports']
    else:
        body = fixture['body']

    assert isinstance(response, resources.OutboundPaymentImport)
    assert responses.calls[-1].request.headers.get('Idempotency-Key') is None
    assert response.amount_sum == body.get('amount_sum')
    assert response.authorisation_url == body.get('authorisation_url')
    assert response.created_at == body.get('created_at')
    assert response.currency == body.get('currency')
    assert response.id == body.get('id')
    assert response.status == body.get('status')
    assert response.entry_counts.failed_to_process == body.get('entry_counts')['failed_to_process']
    assert response.entry_counts.invalid == body.get('entry_counts')['invalid']
    assert response.entry_counts.processed == body.get('entry_counts')['processed']
    assert response.entry_counts.total == body.get('entry_counts')['total']
    assert response.entry_counts.valid == body.get('entry_counts')['valid']
    assert response.entry_counts.verified == body.get('entry_counts')['verified']
    assert response.entry_counts.verified_with_full_match == body.get('entry_counts')['verified_with_full_match']
    assert response.entry_counts.verified_with_no_match == body.get('entry_counts')['verified_with_no_match']
    assert response.entry_counts.verified_with_partial_match == body.get('entry_counts')['verified_with_partial_match']
    assert response.entry_counts.verified_with_unable_to_match == body.get('entry_counts')['verified_with_unable_to_match']
    assert response.links.creditor == body.get('links')['creditor']

@responses.activate
def test_timeout_outbound_payment_imports_get_retries():
    fixture = helpers.load_fixture('outbound_payment_imports')['get']
    with helpers.stub_timeout_then_response(fixture) as rsps:
      response = helpers.client.outbound_payment_imports.get(*fixture['url_params'])
      assert len(rsps.calls) == 2
      assert rsps.calls[0].request.headers.get('Idempotency-Key') == rsps.calls[1].request.headers.get('Idempotency-Key')

    assert isinstance(response, resources.OutboundPaymentImport)

def test_502_outbound_payment_imports_get_retries():
    fixture = helpers.load_fixture('outbound_payment_imports')['get']
    with helpers.stub_502_then_response(fixture) as rsps:
      response = helpers.client.outbound_payment_imports.get(*fixture['url_params'])
      assert len(rsps.calls) == 2
      assert rsps.calls[0].request.headers.get('Idempotency-Key') == rsps.calls[1].request.headers.get('Idempotency-Key')

    assert isinstance(response, resources.OutboundPaymentImport)

@responses.activate
def test_outbound_payment_imports_list():
    fixture = helpers.load_fixture('outbound_payment_imports')['list']
    helpers.stub_response(fixture)
    response = helpers.client.outbound_payment_imports.list(*fixture['url_params'])
    if fixture['body'].get('outbound_payment_imports') is not None and isinstance(fixture['body'].get('outbound_payment_imports'), (dict, list)):
        body = fixture['body']['outbound_payment_imports']
    else:
        body = fixture['body']

    assert isinstance(response, list_response.ListResponse)
    assert isinstance(response.records[0], resources.OutboundPaymentImport)

    assert response.before == fixture['body']['meta']['cursors']['before']
    assert response.after == fixture['body']['meta']['cursors']['after']
    assert responses.calls[-1].request.headers.get('Idempotency-Key') is None
    assert [r.amount_sum for r in response.records] == [b.get('amount_sum') for b in body]
    assert [r.authorisation_url for r in response.records] == [b.get('authorisation_url') for b in body]
    assert [r.created_at for r in response.records] == [b.get('created_at') for b in body]
    assert [r.currency for r in response.records] == [b.get('currency') for b in body]
    assert [r.id for r in response.records] == [b.get('id') for b in body]
    assert [r.status for r in response.records] == [b.get('status') for b in body]

@responses.activate
def test_timeout_outbound_payment_imports_list_retries():
    fixture = helpers.load_fixture('outbound_payment_imports')['list']
    with helpers.stub_timeout_then_response(fixture) as rsps:
      response = helpers.client.outbound_payment_imports.list(*fixture['url_params'])
      assert len(rsps.calls) == 2
      assert rsps.calls[0].request.headers.get('Idempotency-Key') == rsps.calls[1].request.headers.get('Idempotency-Key')

    assert isinstance(response, list_response.ListResponse)
    assert isinstance(response.records[0], resources.OutboundPaymentImport)

    assert response.before == fixture['body']['meta']['cursors']['before']
    assert response.after == fixture['body']['meta']['cursors']['after']

def test_502_outbound_payment_imports_list_retries():
    fixture = helpers.load_fixture('outbound_payment_imports')['list']
    with helpers.stub_502_then_response(fixture) as rsps:
      response = helpers.client.outbound_payment_imports.list(*fixture['url_params'])
      assert len(rsps.calls) == 2
      assert rsps.calls[0].request.headers.get('Idempotency-Key') == rsps.calls[1].request.headers.get('Idempotency-Key')

    assert isinstance(response, list_response.ListResponse)
    assert isinstance(response.records[0], resources.OutboundPaymentImport)

    assert response.before == fixture['body']['meta']['cursors']['before']
    assert response.after == fixture['body']['meta']['cursors']['after']

@responses.activate
def test_outbound_payment_imports_all():
    fixture = helpers.load_fixture('outbound_payment_imports')['list']

    def callback(request):
        if 'after=123' in request.url:
          fixture['body']['meta']['cursors']['after'] = None
        else:
          fixture['body']['meta']['cursors']['after'] = '123'
        return [200, {}, json.dumps(fixture['body'])]

    url_pattern = helpers.url_pattern_for(fixture)
    responses.add_callback(fixture['method'], url_pattern, callback)

    all_records = list(helpers.client.outbound_payment_imports.all(*fixture['url_params']))
    assert len(all_records) == len(fixture['body']['outbound_payment_imports']) * 2
    for record in all_records:
      assert isinstance(record, resources.OutboundPaymentImport)
